In [1]:
import pandas as pd
import sqlite3 as sql

In [5]:
conn = sql.connect('database.sqlite')
conn

In [6]:
pd.read_sql_query('select * from sqlite_master', conn)

,type,name,tbl_name,rootpage,sql
0,table,Salaries,Salaries,2,CREATE TABLE Salaries (\n Id INTEGER PRIMAR...
1,index,salaries_year_idx,Salaries,16566,CREATE INDEX salaries_year_idx ON Salaries (Year)

In [7]:
pd.read_sql_query('select * from salaries', conn)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,,9999999.00,567595.43,2011,,San Francisco,
1,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,,335279.91,335279.91,2011,,San Francisco,
2,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,,332343.61,332343.61,2011,,San Francisco,
3,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,,326373.19,326373.19,2011,,San Francisco,
4,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189082.74,,316285.74,316285.74,2011,,San Francisco,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148648,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,,San Francisco,PT
148649,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148650,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148651,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148652,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,,San Francisco,PT

In [8]:
def sql_query(q):
    return pd.read_sql_query(q,conn)

#### **1. What is the average TotalPayBenefits for each JobTitle? exclude ('Not Provided', 'Not provided')**

In [9]:
q = '''select jobtitle, Avg(TotalPayBenefits) Avg_TPayB
    from Salaries
    Where jobtitle Not In ('Not Provided', 'Not provided') Group By jobtitle
    Order by 1 '''

sql_query(q)

                                            JobTitle     Avg_TPayB
0                                      ACCOUNT CLERK  44035.664337
1                                         ACCOUNTANT  47429.268000
2                                  ACCOUNTANT INTERN  29031.742917
3                        ACPO,JuvP, Juv Prob (SFERS)  80266.370000
4                                      ACUPUNCTURIST  67594.400000
...                                              ...           ...
2153                           X-RAY LABORATORY AIDE  52705.880385
2154                           X-Ray Laboratory Aide  69521.123200
2155  YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS  53632.870000
2156                              Youth Comm Advisor  60118.550000
2157                                     ZOO CURATOR  66686.560000

[2158 rows x 2 columns]

#### **2. Show The JobTitle and Overtime Pay for All Employees With Overtime Pay greater than 50000**

In [14]:
q = ''' select Jobtitle, OvertimePay from Salaries
        Where OvertimePay > 500000
        Order by 2 '''
sql_query(q)

       JobTitle   OvertimePay
0  Not provided  Not Provided
1  Not provided  Not Provided
2  Not provided  Not Provided
3  Not provided  Not Provided

#### **3. What is the total number of unique employees? exclude ('Not Provided', 'Not provided')**

In [17]:
q = ''' select Count(Distinct EmployeeName) as UniqueEN from salaries
        where EmployeeName NOT IN ('Not Provided', 'Not provided') '''
sql_query(q)

   UniqueEN
0    110808

#### **4.Show The Top 10 highest Paid Employees**

In [18]:
q = ''' select Employeename, Jobtitle, TotalpayBenefits from Salaries
        where Employeename Not In ('Not Provided', 'Not provided')
        Order by 2 Desc Limit 10 '''
sql_query(q)

,EmployeeName,JobTitle,TotalPayBenefits
0,MYRON SULAK,ZOO CURATOR,66686.56
1,Mario Yedidia,Youth Comm Advisor,85774.39
2,Phimy Truong,Youth Comm Advisor,77731.38
3,Mario R Yedidia,Youth Comm Advisor,24957.24
4,Phimy Truong,Youth Comm Advisor,52011.19
5,MARIO YEDIDIA,"YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS",53632.87
6,Delbert Lee,X-Ray Laboratory Aide,120158.83
7,Stanley Lee,X-Ray Laboratory Aide,112825.94
8,Nathaniel Intal,X-Ray Laboratory Aide,107172.41
9,Manny Garcia,X-Ray Laboratory Aide,101902.00

#### **5.Show All Employees Ordered By Their TotalPay Benefits In Descending Order**

In [19]:
q = ''' select EmployeeName,JobTitle,TotalPayBenefits
        from salaries where EmployeeName NOT IN ('Not Provided', 'Not provided')
        Order by 3 Desc '''
sql_query(q)

,EmployeeName,JobTitle,TotalPayBenefits
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43
1,David Shinn,Deputy Chief 3,510732.68
2,Amy P Hart,Asst Med Examiner,479652.21
3,William J Coaker Jr.,Chief Investment Officer,436224.36
4,Gregory P Suhr,Chief of Police,425815.28
...,...,...,...
148642,Roy I Tillery,Custodian,0.00
148643,Timothy E Gibson,Police Officer 3,-2.73
148644,Mark E Laherty,Police Officer 3,-8.20
148645,David P Kucia,Police Officer 3,-33.89
148646,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13